mornepousse/KeSp_firmware/boards/conchodytes/sdkconfig.defaults
# Souris Conchodytes — ESP32-S3-WROOM-1U.
#
# Le nom du fichier suit la convention du CMakeLists racine : il retire le
# prefixe "kase_" du nom de board, et "conchodytes" n'en a pas.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_KASE_DEVICE_ROLE_MOUSE=y

# Console sur UART0 (GPIO43/44, connecteur J1). L'USB natif du S3 est bien
# cable (D+/D- sur GPIO19/20) mais la carte ne s'enumere pas a ce jour : on ne
# compte donc pas dessus pour le developpement. Voir la spec, section 6.4.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Tick FreeRTOS a 1 kHz. Le defaut ESP-IDF est 100 Hz, ce qui fait valoir
# vTaskDelay(1) DIX millisecondes — de quoi manquer la moitie des appuis brefs
# et toute la fenetre de rebond. Le dongle releve deja ce reglage
# (sdkconfig.defaults.dongle). Constate le 2026-08-25 : la campagne de mesure
# des clics croyait scruter a 1 kHz et scrutait a 100 Hz.
CONFIG_FREERTOS_HZ=1000

# Pas de BLE : la souris parle au dongle par nRF24. Retirer Bluedroid libere
# ~500 Ko de binaire et supprime une source 2,4 GHz a cote du relais radio.
CONFIG_BT_ENABLED=n
